secondTask/app/controllers/states_controller.rb

  def create
    state = State.create(state_params)
---
INSERT INTO "states" ("body", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "WTF"], ["author", "1"], ["created_at", "2022-07-17 17:02:31.893435"], ["updated_at", "2022-07-17 17:02:31.893435"]]

  def update
    @state.update(state_params)
---
UPDATE "states" SET "author" = ?, "updated_at" = ? WHERE "states"."id" = ?  [["author", "Rafaek"], ["updated_at", "2022-07-18 20:23:42.416292"], ["id", 22]]

  def destroy
    @state.destroy
---
DELETE FROM "states" WHERE "states"."id" = ?  [["id", 20]]

  def index
    @states = State.all
---
SELECT "states".* FROM "states"

  def set_state
    @state = State.find(params[:id])
---
SELECT "states".* FROM "states" WHERE "states"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]