secondTask/app/controllers/users_controller.rb

  def create
    users_params = params.require(:users).permit(:name, :nickname, :email)
    User.create(users_params)
---
INSERT INTO "users" ("name", "nicknanme", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Джон"], ["nicknanme", nil], ["email", "@"], ["created_at", "2022-07-19 16:52:33.842303"], ["updated_at", "2022-07-19 16:52:33.842303"]]