app/controllers/states_controller.rb

  def create
    State.create(
      body: params[:state][:body],
      author: params[:state][:author]
    )
---
INSERT INTO "states" ("body", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "WTF"], ["author", "1"], ["created_at", "2022-07-17 17:02:31.893435"], ["updated_at", "2022-07-17 17:02:31.893435"]]

  def update
    @state = State.find(params[:id])
    @state.update(
      body: params[:state][:body],
      author: params[:state][:author]
    )
---
SELECT "states".* FROM "states" WHERE "states"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "states" SET "body" = ?, "updated_at" = ? WHERE "states"."id" = ?  [["body", "newnew"], ["updated_at", "2022-07-17 18:11:35.127408"], ["id", 1]]

  def destroy
    @state = State.find(params[:id])
    @state.destroy
---
SELECT "states".* FROM "states" WHERE "states"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "states" WHERE "states"."id" = ?  [["id", 2]]

  def show
    @state = State.find(params[:id])
---
SELECT "states".* FROM "states" WHERE "states"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def index
    @states = State.all
---
SELECT "states".* FROM "states"